{
  "title": "Jenovas Vitner: En Final Fantasy-podcast",
  "link": "https://www.radcrew.net/category/finalfantasy",
  "description": "Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad (Gamer.no, LevelUp og Rad Crew) snakker om Final Fantasy og Kingdom Hearts",
  "language": "no",
  "generator": "https://wordpress.org/?v=6.7.1",
  "published": "2024-08-27T06:46:47.000Z",
  "entries": [
    {
      "id": "https://www.radcrew.net/?p=18365",
      "title": "Jenovas Vitner er tilbake: Final Fantasy VII Rebirth",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-vii-rebirth",
      "published": "2024-08-27T06:46:47.000Z",
      "description": "Final Fantasy-podcasten Jenovas Vitner er tilbake med en Final Fantasy VII Rebirth Special! Audun, Karl Martin og Jostein (først og fremst kjent fra Gamer.no, LevelUp Norge og Rad Crew) gjennomgår en liten REBIRTH i denne episoden av Jenovas..."
    },
    {
      "id": "https://www.radcrew.net/?p=17954",
      "title": "Jenovas Vitner Reunion Podcast: Final Fantasy XVI",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-16",
      "published": "2023-08-29T20:07:58.000Z",
      "description": "Final Fantasy-podcasten Jenovas Vitner er tilbake med en Final Fantasy XVI Special! Audun, Karl Martin og Jostein (henholdsvis fra Gamer.no, LevelUp Norge og Rad Crew) har en liten reunion for å snakke om det nyeste skuddet i Final Fantasy-serien:..."
    },
    {
      "id": "http://www.radcrew.net/?p=15191",
      "title": "NoBuddies – En miniserie om Kingdom Hearts #4",
      "link": "https://www.radcrew.net/finalfantasy/nobuddies-en-miniserie-om-kingdom-hearts-4",
      "published": "2019-01-28T22:31:06.000Z",
      "description": "Vi ser tilbake på Kingdom Hearts i denne nye podcast-miniserien. Denne gangen tar vi for oss Dream Drop Distance, X (inkludert Back Cover-filmen) og 0.2 Birth By Sleep: A Fragmentary Passage. I 2017 begynte vi serien Jenovas Vitner, en liten..."
    },
    {
      "id": "http://www.radcrew.net/?p=15166",
      "title": "NoBuddies – En miniserie om Kingdom Hearts #3",
      "link": "https://www.radcrew.net/finalfantasy/nobuddies-en-miniserie-om-kingdom-hearts-3",
      "published": "2019-01-23T17:52:59.000Z",
      "description": "Vi ser tilbake på Kingdom Hearts i denne nye podcast-miniserien. Denne gangen tar vi for oss Kingdom Hearts: Birth By Sleep, Kingdom Hearts: 358/2 Days og og Kingdom Hearts: Re:Coded. I 2017 begynte vi serien Jenovas Vitner, en liten podcast-serie..."
    },
    {
      "id": "http://www.radcrew.net/?p=15138",
      "title": "NoBuddies – En miniserie om Kingdom Hearts #2",
      "link": "https://www.radcrew.net/finalfantasy/nobuddies-en-miniserie-om-kingdom-hearts-2",
      "published": "2019-01-14T22:15:43.000Z",
      "description": "Vi ser tilbake på Kingdom Hearts i denne nye podcast-miniserien. Denne gangen tar vi for oss Kingdom Hearts 2, og Kingdom Hearts: Chain of Memories I 2017 begynte vi serien Jenovas Vitner, en liten podcast-serie om Final Fantasy med Audun Rodem,..."
    },
    {
      "id": "http://www.radcrew.net/?p=15113",
      "title": "NoBuddies – En miniserie om Kingdom Hearts #1",
      "link": "https://www.radcrew.net/finalfantasy/nobuddies-en-miniserie-om-kingdom-hearts-1",
      "published": "2019-01-06T23:29:17.000Z",
      "description": "Hva skjer når Disney og Square Enix kombinerer to av sine mest populære merkevarer? Vi ser tilbake på Kingdom Hearts mens vi venter på det tredje store Kingdom Hearts-spillet, i denne nye podcast-miniserien. I 2017 begynte vi serien Jenovas Vitner,..."
    },
    {
      "id": "http://www.radcrew.net/?p=14846",
      "title": "Jenovas Vitner: Final Fantasy- The Spirits Within",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-the-spirits-within",
      "published": "2018-08-21T10:24:56.000Z",
      "description": "Final Fantasy-podcasten Jenovas Vitner er tilbake! The greatest crossover event in history! Først ut er en episode om en av tidenes største filmflopper: Final Fantasy &#8211; The Spirits Within. Final Fantasy: The Spirits Within var en kritisk og..."
    },
    {
      "id": "http://www.radcrew.net/?p=14021",
      "title": "Final Fantasy IX: Melodies of Life",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-ix",
      "published": "2017-10-31T21:07:51.000Z",
      "description": "Vi går ut på topp med foreløpig siste episode av Final Fantasy-tilbakeblikket Jenovas Vitner. Final Fantasy IX representerer både noe nytt og noe gammelt. Det var et varmt og kjærlig farvel til old school Final Fantasy på mange måter, samtidig som..."
    },
    {
      "id": "http://www.radcrew.net/?p=13975",
      "title": "Final Fantasy XIII: Hva er en L'Cie?",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-xiii",
      "published": "2017-10-18T19:59:15.000Z",
      "description": "Rad Crew presenterer ellevte podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: XIII, XIII-2 og Lightning Returns! Final Fantasy XIII-serien er hatet og elsket, men brakte oss..."
    },
    {
      "id": "http://www.radcrew.net/?p=13843",
      "title": "Final Fantasy MMO-ene: Alltid online",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-mmo-ene",
      "published": "2017-10-04T08:43:03.000Z",
      "description": "Rad Crew presenterer tiende podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: XI og XIV! Final Fantasy XI og XIV skiller seg fra resten: de kan kun spilles online. Begge har..."
    },
    {
      "id": "http://www.radcrew.net/?p=13786",
      "title": "Final Fantasy VI: Magnum Opus",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-vi",
      "published": "2017-09-20T08:29:32.000Z",
      "description": "Rad Crew presenterer niende podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Mesterverket Final Fantasy VI! Final Fantasy VI representerte slutten på SNES-æraen og samtidig også..."
    },
    {
      "id": "http://www.radcrew.net/?p=13740",
      "title": "Final Fantasy XV: Stand by me",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-xv",
      "published": "2017-09-06T14:10:30.000Z",
      "description": "Rad Crew presenterer åttende podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Feelgood buddy-komedien Final Fantasy XV! Final Fantasy XV er det foreløpig siste spillet i serien og..."
    },
    {
      "id": "http://www.radcrew.net/?p=13690",
      "title": "Final Fantasy IV: Hjelp, vi bomba landsbyen!",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-iv",
      "published": "2017-08-23T15:54:04.000Z",
      "description": "Rad Crew presenterer syvende podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Final Fantasy IV! Final Fantasy IV er kanskje det definitive «old school» Final Fantasy-spillet. Det..."
    },
    {
      "id": "http://www.radcrew.net/?p=13653",
      "title": "Final Fantasy XII: Historien om kongeriket Ivalice",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-xii",
      "published": "2017-08-09T10:08:06.000Z",
      "description": "Rad Crew presenterer sjette podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Final Fantasy XII! Final Fantasy XII er kanskje det merkeligste og mest unike spillet i serien...."
    },
    {
      "id": "http://www.radcrew.net/?p=13626",
      "title": "Final Fantasy I til III – Der alt begynte",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-i-iii",
      "published": "2017-07-26T08:32:23.000Z",
      "description": "Rad Crew presenterer femte podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Final Fantasy I til III. De tre første Final Fantasy-spillene kan selvfølgelig ikke matche de nyere..."
    },
    {
      "id": "http://www.radcrew.net/?p=13585",
      "title": "Final Fantasy VIII - Sci fi Harry Potter?",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-viii",
      "published": "2017-07-11T20:54:13.000Z",
      "description": "Rad Crew presenterer fjerde podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Final Fantasy VIII! Final Fantasy VIII sitt kjærlighetsfokus, et omdiskutert og unkt leveling-system,..."
    },
    {
      "id": "http://www.radcrew.net/?p=13555",
      "title": "Final Fantasy V - For komplisert for vestlige spillere?",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-v",
      "published": "2017-06-28T08:23:12.000Z",
      "description": "Rad Crew presenterer tredje podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Final Fantasy V! Final Fantasy V viderefører og utbroderer en del av systemene fra III, og..."
    },
    {
      "id": "http://www.radcrew.net/?p=13520",
      "title": "Final Fantasy X - Det første moderne Final Fantasy",
      "link": "https://www.radcrew.net/finalfantasy/jenovas-vitner-final-fantasy-x",
      "published": "2017-06-13T21:39:56.000Z",
      "description": "Rad Crew presenterer andre podcast-episode i miniserien om Final Fantasy med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: Final Fantasy X! Final Fantasy X er et av de mest populære spillene i serien. Samtidig var det også..."
    },
    {
      "id": "http://www.radcrew.net/?p=13460",
      "title": "Final Fantasy VII - En evig klassiker?",
      "link": "https://www.radcrew.net/finalfantasy/velkommen-til-jenovas-vitner-en-final-fantasy-podcast",
      "published": "2017-05-31T18:00:37.000Z",
      "description": "Rad Crew presenterer første podcast-episode i en miniserie med Audun Rodem, Karl-Martin Hogsnes og Jostein Hakestad. Denne gangen: det legendariske Final Fantasy VII! Det er faktisk om lag 20 år siden Final Fantasy-serien fikk sin begynnelse i..."
    }
  ]
}